/*
Copyright (C) 2016 beardypig

This file is part of Vectrexia.

Vectrexia is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 2 of the License, or
(at your option) any later version.

Vectrexia is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with Vectrexia.  If not, see <http://www.gnu.org/licenses/>.
*/
#ifndef VECTREXIA_M6809_H
#define VECTREXIA_M6809_H

#include <cstdint>
#include <functional>
#include <array>
#include <iostream>
#include <type_traits>
#include <memory>
#include <ostream>
#include "m6809_disassemble.h"

enum m6809_error_t {
    E_SUCCESS = 0,
    E_UNKNOWN_OPCODE = -1,
    E_UNKNOWN_OPCODE_PAGE1 = -2,
    E_UNKNOWN_OPCODE_PAGE2 = -3,
    E_ILLEGAL_INDEXING_MODE = -4
};

enum flag_mask_t {
    FLAG_M = 0x100,  // MUL flag
    FLAG_E = 0x80,   // Entire flag
    FLAG_F = 0x40,   // Fast interrupt mask
    FLAG_H = 0x20,   // Half carry
    FLAG_I = 0x10,   // Interrupt mask
    FLAG_N = 0x08,   // Negative
    FLAG_Z = 0x04,   // Zero
    FLAG_V = 0x02,   // Overflow
    FLAG_C = 0x01,    // Carry
    FLAGS_MATH = FLAG_H | FLAG_N | FLAG_Z | FLAG_V | FLAG_C
};

enum register_task_t {
    REG_CC = 0x01,
    REG_A  = 0x02,
    REG_B  = 0x04,
    REG_DP = 0x08,
    REG_X  = 0x10,
    REG_Y  = 0x20,
    REG_SP = 0x40, // or REG_USP
    REG_PC = 0x80
};

enum m6809_interrupt_state_t
{
    IRQ_NORMAL,
    IRQ_WAIT,
    IRQ_SYNC
};

enum m6809_interrupt_t
{
    NONE, IRQ, FIRQ, NMI
};

class M6809
{
    using ptr_t = M6809*;

    using read_callback_t = uint8_t (*)(intptr_t, uint16_t);
    using write_callback_t = void (*)(intptr_t, uint16_t, uint8_t);
    using opcode_handler_t = void (*)(M6809 &, uint64_t &);

    const uint16_t RESET_VECTOR = 0xfffe;
    const uint16_t NMI_VECTOR   = 0xfffc;
    const uint16_t IRQ_VECTOR   = 0xfff8;
    const uint16_t FIRQ_VECTOR  = 0xfff6;

    static const uint16_t SWI1_VECTOR  = 0xfffa;
    static const uint16_t SWI2_VECTOR  = 0xfff4;
    static const uint16_t SWI3_VECTOR  = 0xfff2;

    M6809Disassemble dis_;

    struct Registers
    {

        Registers() noexcept {
            InitEXGTable();
        }
        Registers(const Registers &rhs) {
            *this = rhs;
        }
        Registers &operator=(const Registers &rhs) noexcept {
            D = rhs.D;
            X = rhs.X;
            Y = rhs.Y;
            PC = rhs.PC;
            USP = rhs.USP;
            SP = rhs.SP;
            DP = rhs.DP;
            CC = rhs.CC;
            InitEXGTable();
            return *this;
        }
        ~Registers() = default;
        union
        {
            struct
            {
                // Swap for endianness
#ifdef __MSB_FIRST
                uint8_t A, B;
#else
                uint8_t B, A;
#endif
            };
            uint16_t D = 0;
        };
        uint16_t X = 0;
        uint16_t Y = 0;
        uint16_t PC = 0;        // Program Counter
        uint16_t USP = 0;       // User Stack Pointer
        uint16_t SP = 0;        // Stack Pointer
        uint8_t DP = 0;         // Direct Page register
        union
        {
            uint8_t CC = 0;     // Condition Code
            struct
            {
                uint8_t C : 1;  // 01
                uint8_t V : 1;  // 02
                uint8_t Z : 1;  // 04
                uint8_t N : 1;  // 08
                uint8_t I : 1;  // 10
                uint8_t H : 1;  // 20
                uint8_t F : 1;  // 40
                uint8_t E : 1;  // 80
            } flags;
        };

        std::array<uint16_t*, 6> exg_table_16{};
        std::array<uint8_t*, 4> exg_table_8{};
        std::array<uint16_t*, 4> index_mode_register_table{};

        void InitEXGTable() {
            exg_table_16 = { &D, &X, &Y, &USP, &SP, &PC };
            exg_table_8 = {&A, &B, &CC, &DP};
            index_mode_register_table = { &X, &Y, &USP, &SP };
        }

        // update the zero flag, based on value
        template<typename T>
        inline void UpdateFlagZero(const T &value)
        {
            CC &= ~FLAG_Z;
            CC |= FLAG_Z * ((value == 0) ? 1u : 0u);
        };

        // update the negative flag, based on value
        template <typename T>
        inline void UpdateFlagNegative(const T &value)
        {
            CC &= ~FLAG_N;
            CC |= FLAG_N * ((value >> ((sizeof(T) * 8) - 1u)) & 1u);
        };

