#ifndef VECTREXIA_M6809_H
#define VECTREXIA_M6809_H

#include <stdint.h>
#include <functional>
#include <array>
#include <iostream>
#include <type_traits>
#include <memory>
#include <ostream>

enum m6809_error_t {
    E_SUCCESS = 0,
    E_UNKNOWN_OPCODE = -1,
    E_UNKNOWN_OPCODE_PAGE1 = -2,
    E_UNKNOWN_OPCODE_PAGE2 = -3,
    E_ILLEGAL_INDEXING_MODE = -4,
};

enum flag_mask_t {
    FLAG_E = 0x80,   // Entire flag
    FLAG_F = 0x40,   // Fast interrupt mask
    FLAG_H = 0x20,   // Half carry
    FLAG_I = 0x10,   // Interrupt mask
    FLAG_N = 0x08,   // Negative
    FLAG_Z = 0x04,   // Zero
    FLAG_V = 0x02,   // Overflow
    FLAG_C = 0x01,    // Carry
    FLAGS_MATH = FLAG_H | FLAG_N | FLAG_Z | FLAG_V | FLAG_C
};

enum register_task_t {
    REG_CC = 0x01,
    REG_A  = 0x02,
    REG_B  = 0x04,
    REG_DP = 0x08,
    REG_X  = 0x10,
    REG_Y  = 0x20,
    REG_SP = 0x40, // or REG_USP
    REG_PC = 0x80
};

struct M6809Registers;

class M6809
{
    using read_callback_t = uint8_t (*)(intptr_t, uint16_t);
    using write_callback_t = void (*)(intptr_t, uint16_t, uint8_t);
    using opcode_handler_t = void (*)(M6809 &, int &);

    static const uint16_t RESET_VECTOR = 0xfffe;

    struct M6809Registers
    {
        union
        {
            struct
            {
                // Swap for endianness
#ifdef __MSB_FIRST
                uint8_t A, B;
#else
                uint8_t B, A;
#endif
            };
            uint16_t D;
        };
        uint16_t X, Y;
        uint16_t PC;
        uint16_t USP, SP;   // User Stack Pointer and Stack Pointer
        uint8_t DP;         // Direct Page register
        union
        {
            uint8_t CC;         // Condition Code
            struct
            {
                uint8_t C : 1;  // 01
                uint8_t V : 1;  // 02
                uint8_t Z : 1;  // 04
                uint8_t N : 1;  // 08
                uint8_t I : 1;  // 10
                uint8_t H : 1;  // 20
                uint8_t F : 1;  // 40
                uint8_t E : 1;  // 80
            } flags;
        };

    } registers;


    // memory accessors
    //   callbacks
    read_callback_t read_callback_func;
    intptr_t read_callback_ref;
    write_callback_t write_callback_func;
    intptr_t write_callback_ref;

    bool wait_for_intterupt = false;

    uint16_t *index_mode_register_table[4] = {
            &registers.X,
            &registers.Y,
            &registers.USP,
            &registers.SP
    };

    intptr_t exg_register_table[0xc] = {
            reinterpret_cast<intptr_t >(&registers.D),
            reinterpret_cast<intptr_t >(&registers.X),
            reinterpret_cast<intptr_t >(&registers.Y),
            reinterpret_cast<intptr_t >(&registers.USP),
            0, 0,
            reinterpret_cast<intptr_t >(&registers.SP),
            reinterpret_cast<intptr_t >(&registers.A),
            reinterpret_cast<intptr_t >(&registers.B),
            reinterpret_cast<intptr_t >(&registers.CC),
